In [15]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import csv
import pyspark as psk

In [16]:
co2df = pd.read_csv("CarbonDiOxide_Emmissions_Data.csv")
co2df

,country,year,iso_code,population,gdp,cement_co2,cement_co2_per_capita,co2,co2_growth_abs,co2_growth_prct,...,share_global_other_co2,share_of_temperature_change_from_ghg,temperature_change_from_ch4,temperature_change_from_co2,temperature_change_from_ghg,temperature_change_from_n2o,total_ghg,total_ghg_excluding_lucf,trade_co2,trade_co2_share
0,Afghanistan,1850,AFG,3752993.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,1851,AFG,3767956.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,0.157,0.000,0.000,0.000,0.0,NaN,NaN,NaN,NaN
2,Afghanistan,1852,AFG,3783940.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,0.156,0.000,0.000,0.000,0.0,NaN,NaN,NaN,NaN
3,Afghanistan,1853,AFG,3800954.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,0.156,0.000,0.000,0.000,0.0,NaN,NaN,NaN,NaN
4,Afghanistan,1854,AFG,3818038.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,0.155,0.000,0.000,0.000,0.0,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
47410,Zimbabwe,2018,ZWE,15052191.0,2.678627e+10,0.558,0.037,10.715,1.419,15.265,...,NaN,0.114,0.001,0.001,0.002,0.0,116.76,29.37,-0.088,-0.825
47411,Zimbabwe,2019,ZWE,15354606.0,2.514642e+10,0.473,0.031,9.775,-0.939,-8.765,...,NaN,0.113,0.001,0.001,0.002,0.0,116.03,28.70,0.143,1.463
47412,Zimbabwe,2020,ZWE,15669663.0,2.317871e+10,0.496,0.032,7.850,-1.926,-19.700,...,NaN,0.112,0.001,0.001,0.002,0.0,113.20,25.99,0.818,10.421
47413,Zimbabwe,2021,ZWE,15993525.0,2.514009e+10,0.531,0.033,8.396,0.547,6.962,...,NaN,0.110,0.001,0.001,0.002,0.0,NaN,NaN,1.088,12.956
47414,Zimbabwe,2022,ZWE,16320539.0,2.590159e+10,0.531,0.033,8.856,0.460,5.477,...,NaN,0.110,0.001,0.001,0.002,0.0,NaN,NaN,NaN,NaN

In [17]:
co2df.dtypes

country                         object
year                             int64
iso_code                        object
population                     float64
gdp                            float64
                                ...
temperature_change_from_n2o    float64
total_ghg                      float64
total_ghg_excluding_lucf       float64
trade_co2                      float64
trade_co2_share                float64
Length: 79, dtype: object

In [18]:
grouped_df = pd.DataFrame(co2df.groupby('country')['co2'].sum())
grouped_df

                           co2
country
Afghanistan            230.757
Africa               51012.393
Africa (GCP)         51011.964
Albania                298.889
Algeria               5076.843
...                        ...
Wallis and Futuna        0.798
World              1772867.527
Yemen                  687.572
Zambia                 268.456
Zimbabwe               798.693

[261 rows x 1 columns]

In [19]:
co2df_desc = pd.read_csv("Co2_Data_Desc.csv")
co2df_desc

,column,description,unit,source
0,country,Country - Geographic location.,NaN,Our World in Data - Regions (2022)
1,year,Year - Year of observation.,NaN,Our World in Data - Regions (2022)
2,iso_code,ISO code - ISO 3166-1 alpha-3 three-letter cou...,NaN,International Organization for Standardization...
3,population,"Population - Population by country, available ...",persons,Population based on various sources (2023) [ht...
4,gdp,Gross domestic product (GDP) - This data is ad...,international-$ in 2011 prices,Bolt and van Zanden - Maddison Project Databas...
...,...,...,...,...
74,temperature_change_from_n2o,Change in global mean surface temperature caus...,°C,Jones et al. - National contributions to clima...
75,total_ghg,Total greenhouse gas emissions including land-...,million tonnes,Climate Watch - Greenhouse gas emissions by se...
76,total_ghg_excluding_lucf,Total greenhouse gas emissions excluding land-...,million tonnes,Climate Watch - Greenhouse gas emissions by se...
77,trade_co2,Annual CO₂ emissions embedded in trade - Annua...,million tonnes,Global Carbon Budget (2023) [https://globalcar...
78,trade_co2_share,Share of annual CO₂ emissions embedded in trad...,%,Global Carbon Budget (2023) [https://globalcar...

In [20]:
data_df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)
data_df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [21]:
data_df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [22]:
ages_df = pd.Series([22, 36, 58], name="Age")
ages_df

0    22
1    36
2    58
Name: Age, dtype: int64

In [24]:
int(data_df['Age'].max())

58

In [25]:
data_list= [['Alice', 25, 'New York'], 
        ['Bob', 30, 'Los Angeles'], 
        ['Charlie', 28, 'Chicago']]
df_list = pd.DataFrame(data_list, columns=['Name', 'Age', 'City'])
print(df_list)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   28      Chicago

In [26]:
df_list.set_index('Name', inplace=False)

         Age         City
Name
Alice     25     New York
Bob       30  Los Angeles
Charlie   28      Chicago

In [27]:
df_list

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   28      Chicago

In [28]:
df_list.set_index('Name', inplace=True)
df_list

         Age         City
Name
Alice     25     New York
Bob       30  Los Angeles
Charlie   28      Chicago